## Travaux pratiques n1

### Exercice 1: Calcul Scientifique avec numpy

In [20]:
import numpy as np

In [21]:
sales = np.array([
  [100, 200, 150],
  [250, 300, 200],
  [175, 225, 275],
  [300, 250, 225]
])

1. Moyenne globale des ventes

In [22]:
moy_glob = np.mean(sales)
moy_glob

220.83333333333334

2. Somme des ventes pour chaque produit, en exculant le mois de Janvier

In [23]:
s_v1 = np.sum(sales[1:], axis=0)

3. Somme des ventes pour chaque produit pour les mois ou les vents ont été supérieurs à la moyenne globale.

In [24]:
np.where(sales<moy_glob, 0, sales).sum(axis=0)

array([550, 775, 500])

4. Créer un tableau de booléan indiquant si chaque vente est supérieur ou égale à 200

In [25]:
sales_bool = np.where(sales >= 200, True, False)
sales 
sales_bool

array([[False,  True, False],
       [ True,  True,  True],
       [False,  True,  True],
       [ True,  True,  True]])

5. Afficher la position du plus grand élément des 'sales' sous forme d'un tuple (ligne, colonne)

In [26]:
# TODO
res = (int(np.argmax(sales)+1) // len(sales), int(np.argmax(sales)+1) % len(sales))
np.unravel_index(np.argmax(sales), sales.shape)

(1, 1)

## Exercice 2 - Exploration des données avec pandas

1. Generer un Dataframe

In [27]:
import pandas as pd

In [28]:
biens=np.array([
  [85, 120],
  [100, 200],
  [85, 150],
  [200, 180],
  [100, 420],
  [300, 330],
  [400, 400]
])
biens.shape

(7, 2)

In [29]:
df_biens = pd.DataFrame(biens, columns=["surface", "prix"])
df_biens.head()

   surface  prix
0       85   120
1      100   200
2       85   150
3      200   180
4      100   420

2. Afficher les surfaecs des biens ayant un prix supérieur ou égal à 300

In [30]:
res2 = df_biens[df_biens['prix'] >= 300]['surface']
res2

4    100
5    300
6    400
Name: surface, dtype: int64

3. Créer une nouvelle colonne, nommé total, à la fin de df_biens contenant les prix totaux des biens. Renommer la colonne total par prixT.

In [31]:
def calculate_prix_total(entry):
  return entry['surface'] * entry['prix']

df_biens['prixT'] = df_biens.apply(calculate_prix_total, axis=1)
df_biens

# The __.apply() will accept entries from the dataframe as series; takes a row(col1, col2, ...) if axis=1, or a column if axis=0 (row0, row1, ...)

   surface  prix   prixT
0       85   120   10200
1      100   200   20000
2       85   150   12750
3      200   180   36000
4      100   420   42000
5      300   330   99000
6      400   400  160000

4. Créer une nouvelle colonne, nommée categorie, à la fin de df_biens qui prend la valeur 'B' si prixT est inférieur ou égal à 32400 et la surface est strictement inférieure à 120, et 'A' dans le cas contraire.

In [32]:
def define_category(entry):
  if (entry['prixT'] <= 32400 and entry['surface'] < 120):
    return 'B'
  else:
    return 'A'
  
df_biens['catégorie'] = df_biens.apply(define_category, axis=1)
df_biens

   surface  prix   prixT catégorie
0       85   120   10200         B
1      100   200   20000         B
2       85   150   12750         B
3      200   180   36000         A
4      100   420   42000         A
5      300   330   99000         A
6      400   400  160000         A

5. Supprimer la colonne surface de df_biens

In [33]:
df_biens.drop(labels=['surface'], axis=1, inplace=True)
df_biens

   prix   prixT catégorie
0   120   10200         B
1   200   20000         B
2   150   12750         B
3   180   36000         A
4   420   42000         A
5   330   99000         A
6   400  160000         A

6. Trier les biens de df_biens par order décroissant selon prixT et réinitialiser les indices des linges

In [35]:
df_biens.sort_values(by='prixT', ascending=False, ignore_index=True, inplace=True)
df_biens

   prix   prixT catégorie
0   400  160000         A
1   330   99000         A
2   420   42000         A
3   180   36000         A
4   200   20000         B
5   150   12750         B
6   120   10200         B

7. Afficher le prix le plus cher pour chaque catégorie de biens

In [37]:
df_biens.groupby("catégorie")['prix'].max()

catégorie
A    420
B    200
Name: prix, dtype: int64

### Exercice 3: Visualisation graphique avec matplotlib & seaborn

1. Charger le jeu de données "athlete.csv" dans un DataFrame nommé df_athlete, puis afficher sa taille et les types de données de chaque attribut

In [46]:
import matplotlib.pyplot as plt

In [45]:
df_athlete = pd.read_csv("./datasets/athlete.csv")
df_athlete.ndim
df_athlete.shape
df_athlete.dtypes

Sex        object
Age       float64
Height    float64
Weight    float64
Sport      object
dtype: object

2. Tracer une courbe montrant le poids maximum des athlètes en fonction de leur âge, en marquant la valeur maximale des poids des athlètes ayant l'âge de 16 ans.

In [ ]:
plt.figure(figsize=(11, 3))
plt.subplot